soap-web-services-in-10-steps/useful-files-not-used-in-project/GetCourseDetailsRequest_withSecurity.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header>
                <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" mustUnderstand="1">
                    <wsse:UsernameToken>
                        <wsse:Username>user</wsse:Username>
                        <wsse:Password>password</wsse:Password>
                    </wsse:UsernameToken>
                </wsse:Security>
            </Header>
    <Body>
        <getCourseDetailsRequest xmlns="http://in28minutes.com/courses">
            <id>Course1</id>
        </getCourseDetailsRequest>
    </Body>
</Envelope>